frolk/scale-driver_nrf52/main.c


#include <stdbool.h>
#include <stdint.h>
#include <string.h>

#include "nordic_common.h"
#include "nrf.h"
#include "app_error.h"
#include "ble.h"
#include "ble_hci.h"
#include "ble_srv_common.h"
#include "ble_advdata.h"
#include "ble_advertising.h"
#include "ble_conn_params.h"
#include "softdevice_handler.h"
#include "app_timer.h"
#include "fstorage.h"
#include "fds.h"
#include "peer_manager.h"
#include "bsp_btn_ble.h"
#include "ble_hci.h"
#include "ble_advdata.h"
#include "ble_advertising.h"
#include "ble_conn_state.h"
#include "ble_dfu.h"
#include "nrf_ble_gatt.h"
#include "SEGGER_RTT.h"
#include "app_uart.h"
#include "nrf_delay.h"
#include "rgb_led.h"
#include "nrf_drv_gpiote.h"
#include "hx711.h"
#include "correct.h"
#include "remote.h"
#include "fds.h"
#include "flash_storage.h"
#include "remote_work.h"

#include "app_pwm.h"


#define NRF_LOG_MODULE_NAME "APP"
#include "nrf_log.h"
#include "nrf_log_ctrl.h"


#define APP_FEATURE_NOT_SUPPORTED       BLE_GATT_STATUS_ATTERR_APP_BEGIN + 2        /**< Reply when unsupported features are requested. */

#define DEVICE_NAME                     "Scale-driver5"                         /**< Name of device. Will be included in the advertising data. */
#define MANUFACTURER_NAME               "Etalon"                       /**< Manufacturer. Will be passed to Device Information Service. */
#define APP_ADV_INTERVAL                300                                         /**< The advertising interval (in units of 0.625 ms. This value corresponds to 187.5 ms). */
#define APP_ADV_TIMEOUT_IN_SECONDS      180                                         /**< The advertising timeout in units of seconds. */

#define MIN_CONN_INTERVAL               MSEC_TO_UNITS(100, UNIT_1_25_MS)            /**< Minimum acceptable connection interval (0.1 seconds). */
#define MAX_CONN_INTERVAL               MSEC_TO_UNITS(200, UNIT_1_25_MS)            /**< Maximum acceptable connection interval (0.2 second). */
#define SLAVE_LATENCY                   0                                           /**< Slave latency. */
#define CONN_SUP_TIMEOUT                MSEC_TO_UNITS(4000, UNIT_10_MS)             /**< Connection supervisory timeout (4 seconds). */

#define FIRST_CONN_PARAMS_UPDATE_DELAY  APP_TIMER_TICKS(5000)                       /**< Time from initiating event (connect or start of notification) to first time sd_ble_gap_conn_param_update is called (5 seconds). */
#define NEXT_CONN_PARAMS_UPDATE_DELAY   APP_TIMER_TICKS(30000)                      /**< Time between each call to sd_ble_gap_conn_param_update after the first call (30 seconds). */
#define MAX_CONN_PARAMS_UPDATE_COUNT    3                                           /**< Number of attempts before giving up the connection parameter negotiation. */

#define SEC_PARAM_BOND                  1                                           /**< Perform bonding. */
#define SEC_PARAM_MITM                  0                                           /**< Man In The Middle protection not required. */
#define SEC_PARAM_LESC                  0                                           /**< LE Secure Connections not enabled. */
#define SEC_PARAM_KEYPRESS              0                                           /**< Keypress notifications not enabled. */
#define SEC_PARAM_IO_CAPABILITIES       BLE_GAP_IO_CAPS_NONE                        /**< No I/O capabilities. */
#define SEC_PARAM_OOB                   0                                           /**< Out Of Band data not available. */
#define SEC_PARAM_MIN_KEY_SIZE          7                                           /**< Minimum encryption key size. */
#define SEC_PARAM_MAX_KEY_SIZE          16                                          /**< Maximum encryption key size. */

#define DEAD_BEEF                       0xDEADBEEF       


#define FILE_ID     0x1111
#define REC_KEY     0x2222

#define MAX_TEST_DATA_BYTES     (15U)                /**< max number of test bytes to be used for tx and rx. */
#define UART_TX_BUF_SIZE 256                         /**< UART TX buffer size. */
#define UART_RX_BUF_SIZE 256                         /**< UART RX buffer size. */
#define SCD_RX_PIN_NUMBER 19
#define SCD_TX_PIN_NUMBER 20

//#define APP_TIMER_MAX_TIMERS 1


#define CORRECT_TURN_ON 150000

APP_TIMER_DEF(m_clock_id);

uint8_t clock_counter = 0;

//static volatile uint8_t write_flag=0;

/**< Value used as error code on stack dump, can be used to identify stack location on stack unwind. */

static uint16_t       m_conn_handle = BLE_CONN_HANDLE_INVALID;                      /**< Handle of the current connection. */
static ble_dfu_t      m_dfus;                                                       /**< Structure used to identify the DFU service. */
static nrf_ble_gatt_t m_gatt;   



void clock_value_save(void)
{
		uint32_t err_code;
		life_counter+=1;
		
		err_code = fds_update_value(&life_counter, file_id, fds_rk_clock);
		//APP_ERROR_CHECK(err_code);	
		clock_counter = 0;
		if(life_counter%50 == 0)
		{
			fds_clear();
		}
}

static void m_clock_timer_handler (void *p_context)
{
	clock_counter++;
	//SEGGER_RTT_printf(0, "%d, %d\r\n", life_counter, clock_counter);
	SEGGER_RTT_printf(0, "%d, %d, %d\r\n", adc_value, life_counter, power_down_count);
	if(clock_counter >= 1)
	{
			clock_value_save();
	}
	//SEGGER_RTT_printf(0, "clock_counter = %d\r\n", clock_counter);
}

void fds_get_init_data()
{
	fds_get_data(&life_counter, file_id, fds_rk_clock);
	fds_get_data(&power_down_count, file_id, fds_rk_power_down);
	power_down_count++;
	fds_update_value(&power_down_count, file_id, fds_rk_power_down);
  init_corr_values();

		//APP_ERROR_CHECK(err_code);
}

static void m_clock_timer_init(void)
{
	app_timer_init();
	app_timer_create(&m_clock_id, APP_TIMER_MODE_REPEATED, m_clock_timer_handler); 
	app_timer_start(m_clock_id, APP_TIMER_TICKS(500), NULL);
}


/**< GATT module instance. */
// YOUR_JOB: Use UUIDs for service(s) used in your application.
static ble_uuid_t m_adv_uuids[] = {{BLE_UUID_DEVICE_INFORMATION_SERVICE, BLE_UUID_TYPE_BLE}};
static void advertising_start(bool erase_bonds);
static void ble_dfu_evt_handler(ble_dfu_t * p_dfu, ble_dfu_evt_t * p_evt)
{
    switch (p_evt->type)
    {
        case BLE_DFU_EVT_INDICATION_DISABLED:
            NRF_LOG_INFO("Indication for BLE_DFU is disabled.\r\n");
            break;

